In [8]:
import pandas as pd

data = pd.DataFrame({
    "order_id": [1, 2, 3, 4, 5, 6],
    "customer_id": [101, 102, 101, 103, 102, 103],
    "order_date": ["2024-01-01", "2024-01-02", "2024-01-03",
        "2024-01-04", "2014-01-05", "2024-01-06"],
    "product": ["Apples", "Bananas", "Oranges",
        "Apples", "Bananas", "Oranges"],
    "amount": [100, 200, 150, 50, 300, 100]
})

### Задачи:
1. Найти суммарный объем продаж ('amount') для каждого продукта
2. Отфильтровать продукты с суммарными продажами больше 200

In [9]:
data

   order_id  customer_id  order_date  product  amount
0         1          101  2024-01-01   Apples     100
1         2          102  2024-01-02  Bananas     200
2         3          101  2024-01-03  Oranges     150
3         4          103  2024-01-04   Apples      50
4         5          102  2014-01-05  Bananas     300
5         6          103  2024-01-06  Oranges     100

### 1. Суммарный объем продаж для каждого продукта

In [10]:
data[['product', 'amount']].groupby('product', as_index=False).sum()

   product  amount
0   Apples     150
1  Bananas     500
2  Oranges     250

In [11]:
data.groupby('product', as_index=False)['amount'].sum()

   product  amount
0   Apples     150
1  Bananas     500
2  Oranges     250

In [12]:
product_data = data.groupby('product', as_index=False)['amount'].sum()
product_data.columns = ['product','total_amount']
product_data

   product  total_amount
0   Apples           150
1  Bananas           500
2  Oranges           250

### 2. Фильтрация про суммарным продажам больше 200

In [13]:
product_data[product_data['total_amount'] >= 200]

   product  total_amount
1  Bananas           500
2  Oranges           250

In [14]:
top_product_data = product_data[product_data['total_amount'] >= 200]
top_product_data.columns = ['top_product','total_amount']
top_product_data

  top_product  total_amount
1     Bananas           500
2     Oranges           250